Autodesk.Revit.DB.UpdaterRegistry.AddTrigger(Autodesk.Revit.DB.UpdaterId,Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ChangeType)
Adds a trigger to an updater with specified set of elements and ChangeType
id:
Id of updater that trigger should be added to
document:
Document that elements in 'elements' are contained in
elements:
Set of elements which define this trigger
change:
ChangeType associated with this trigger
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
updater's owner AddIn does not match the currently active AddIn
-or-
id does not correspond to any registered Updaters
-or-
AddTrigger called while executing an updater.
Since:
2011